<div class="center_side clear">
    <article class="article">
        <h1>Задание для веб-дизайнеров</h1>
        <p>Наша команда будет учиться создавать профессиональные проекты на достойном уровне. Качественная реализация каждой детали — именно то, на что будет делаться упор в первую очередь. От дизайна наших проектов будет зависеть лицо всей команды. Вы получите возможность разрабатывать дизайн внешних и внутренних сервисов, работать над интересными задачами, изучать мировой опыт и учиться элегантно решать непростые задачи.</p>
        <p>В качестве тестового задания мы выбрали для вас интересную и увлекательную задачу, которая потребует изучения конкретной темы, проектирования и отрисовки дизайна, а также воплощения его в жизнь, то есть верстки.</p>
        <p>Все члены нашей команды в процессе работы будут решать те или иные задачи в своей области, зачастую весьма интересные и нетривиальные. В ходе решения таких задач мы будем получать ценный опыт, которым хотелось бы поделиться с другими. Так у нас появилась идея — у каждого члена команды будет возможность писать статьи о решаемой проблеме и своем опыте. Благодаря этому мы будем закреплять материал и обмениваться опытом, а также учиться грамотно и интересно складывать слова в тексты, выражать свои мысли.</p>
        <p>Предлагаем вам разработать страницу просмотра такой статьи.</p>
        <h2>Часть 1. Дизайн страницы медиа-публикации</h2>
        <p>Итак, вам нужно разработать дизайн для страницы просмотра статьи. В процессе работы рекомендуем вам изучить опыт передовых российских и мировых медиа-площадок, выделить оттуда лучшие решения и реализовать в своем макете. Каждая статья будет содержать заголовок, подзаголовок («лид»), дату и текст. В тексте могут присутствовать изображения, цитаты, подзаголовки, списки и другие элементы. Особое внимание следует уделить типографике, то есть тому, насколько статья будет хорошо читаться. Для этого следует проработать сочетание фамилии шрифта, размеров и междустрочного интервала, а также отступам между абзацами и другими элементами. В остальном — вы можете изобразить любые элементы, какие вам покажутся нужными: комментарии, кнопки социальных сетей и др.</p>
        <p>Общий стиль страницы должен соответствовать данному сайту, то есть быть минималистичным, светлым и легким.</p>
        <h2>Часть 2. Верстка макета</h2>
        <p>Веб-дизайнер работает на передовой линии создания и поддержки проектов, он должен обладать пониманием технологий и навыками веб-разработки. Поэтому, вторая часть вашего задания будет заключаться в реализации вашего макета с помощью верстки.</p>
        <p>Рекомендуем следовать тем же принципам легкости и простоты: использовать минимальное количество тегов и CSS-правил.</p>
        <h2>Часть 3. Размещение на сервере</h2>
        <p>Полученные шаблоны страниц следует разместить на сервере и обеспечить доступ к ним по прямой ссылке. Для этого вам придется разобраться с тем, как работают бесплатные хостинги.</p>
        <p>Надеемся, задание покажется вам интересным! </p>
    </article>
</div>