<div class="center_side clear">
    <article class="article">

        <h1 class="article__title">
            Дизайн
        </h1>

        <div class="article_content">
            <p>
                Есть три задания. Какие выбрать — решать вам.
            </p>
            <h2>Генератор таблиц</h2>
            <p>
                Посмотрите на задачку для <a href="/task/frontend">фронтенд-разработки</a>. Там приведены макеты того, как мог бы выглядеть интерфейс простейшего генератора обложек для статей.
                Предлагаем вам подумать над интерфейсом похожего инструмента: генератора таблиц.
                Он будет использоваться для оформления табличных данных в статьях, поэтому по ширине размер не должен превышать <span class="technic">650px</span>. Модуль должен содержать минимальный набор функций, достаточных для создания простых таблиц. Как минимум это:
            </p>
            <p>
                <ul>
                    <li>Возможность добавить/удалить столбец</li>
                    <li>Возможность добавить/удалить строку</li>
                    <li>Возможность объединить несколько ячеек</li>
                </ul>
            </p>
            <h2>Дизайн ленты статей</h2>
            <p>
                Посмотрите на <a href="/articles">это</a>. Мы давно думаем над тем, какой должна быть лента статей. Предложите свои идеи (макеты) того, как можно было бы обновить этот раздел. Вот что нам нужно:
            </p>
            <p>
                <ul>
                    <li>Каждая статья имеет заголовок, дату, имя и фото автора</li>
                    <li>У статей могут появиться обложки</li>
                    <li>Статьи могут выводиться в «широкой» верстке, то есть быть крупнее в ленте</li>
                    <li>В списке могут быть Курсы — это несколько статей, объединенных под каким-то заголовком</li>
                </ul>
            </p>
            <p>
                Рекомендуем ознакомиться с крупнейшими медиа-проектами и изучить их хорошие и плохие решения.
            </p>
            <h2>Аудит главной страницы сайта ИТМО</h2>
            <p>
                Изучите главную страницу <a href="//ifmo.ru">сайта Университета ИТМО</a>. Что бы вы предложили улучшить, добавить или убрать? Предложите свои идеи в виде отчета и прототипов/макетов. Наиболее удачные решения могут быть воплощены в последующих обновлениях сайта.
            </p>
        </div>
    </article>
</div>
