<link rel="stylesheet" href="/public/build/bundle.css?v=<?= filemtime("public/build/bundle.css") ?>">

<div class="center_side clear">

    <article class="article">

        <h1 class="article__title">Задание <br> для веб-дизайнеров</h1>

        <div class="article_content">
            <p>Наша команда будет учиться создавать профессиональные проекты на достойном уровне. Качественная реализация каждой детали — именно то, на что будет делаться упор в первую очередь. От дизайна наших проектов будет зависеть лицо всей команды. Вы получите возможность разрабатывать дизайн внешних и внутренних сервисов, работать над интересными задачами, изучать мировой опыт и учиться элегантно решать непростые задачи.</p>
            <p>В качестве тестового задания мы выбрали интересную и непростую задачу, которая потребует изучения конкретной темы, проектирования и отрисовки дизайна, а также воплощения его в жизнь, то есть верстки.</p>
            <p>Все члены нашей команды в процессе работы будут решать те или иные задачи в своей области, зачастую весьма интересные и нетривиальные. В ходе решения таких задач мы будем получать ценный опыт, о котором можно рассказать сообществую в небольшой статье.
            Благодаря этому мы будем закреплять материал и обмениваться опытом, а также учиться грамотно и интересно складывать слова в тексты, выражать свои мысли.</p>
            <p>Модуль статей у нас уже <a href="/articles">есть</a>. Как можно заметить, в нем уже есть статьи, которые можно было бы объединить под одной темой, например, «изучение Python» или «Разработка ботов для Telegram». Такие тематические «курсы» логично дополнять небольшими заданиями для проверки знаний.</p>
            <p>Предлагаем вам разработать систему объединения статей в курсы.</p>
            <h2>Часть 1. Дизайн</h2>
            <h3>Страница курса</h3>
            <p>
                Итак, вам нужно разработать дизайн для страницы курса со списком входящих в него материалов. У курса будет название, описание, непосредственно список статей, а также кнопки «Поделиться» основных социальных сетей. У каждой статьи есть название, автор и, опционально, описание.
            </p>
            <p>
                Должно быть четко понятно, в каком порядке рекомендуется читать материалы.
            </p>
            <h3>Доработка страницы статьи</h3>
            <p>Вместе с этим нужно доработать дизайн страницы конкретной статьи: зашедший читатель должен понимать, что данная статья является определенной частью курса, скажем третьей из пяти. Должно быть понимание, какой именно это курс, какие статьи идут до и после данного материала. Пользователь должен понимать, что перед данной статьей рекомендуется ознакомиться с предыдущими.</p>

            <h3>Дизайн тестовых заданий</h3>
            <p>
                В конце каждой части курса, пользователю будет предложено пройти небольшой тест, чтобы закрепить материал. Предлагаем вам подумать, как бы это могло выглядеть. Помимо непосредственно дизайна самого теста, следует решить вопрос с тем, где и как он должен располагаться: в конце статьи, в списке статей или на отдельной странице.
            </p>
            <p>
                Тестовые задания (в будущем, возможно, игры) должны быть гармоничной составляющей системы курсов.
            </p>
            <p>Общий стиль страницы должен соответствовать данному сайту, то есть быть минималистичным, светлым и легким.</p>
            <p>Немного примеров:</p>
            <p>
                <ul>
                    <li><a href="https://developers.google.com/web/fundamentals/getting-started/" target="_blank">Курсы Google для веб-разработчиков</a></li>
                    <li><a href="http://journal.tinkoff.ru/right/" target="_blank">Рубрики в Tinkoff Journal</a></li>
                    <li><a href="https://meduza.io/games" target="_blank">Игры «Медузы»</a></li>
                </ul></p>
            <h2>Часть 2. Верстка макета</h2>
            <p>Веб-дизайнер работает на передовой линии создания и поддержки проектов, он должен обладать пониманием технологий и навыками веб-разработки. Поэтому, вторая часть вашего задания будет заключаться в реализации ваших макетов с помощью верстки.</p>
            <p>Рекомендуем следовать тем же принципам легкости и простоты: использовать минимальное количество тегов и CSS-правил.</p>
            <h2>Часть 3. Размещение на сервере</h2>
            <p>Полученные шаблоны страниц следует разместить на сервере и обеспечить доступ к ним по прямой ссылке.</p>
            <p>Надеемся, задание покажется вам интересным! </p>
        </div>
    </article>
</div>