<div class="center_side">
    <article class="article">
        <h1>Задание для веб-разрабочиков</h1>

        <p>
            На плечи разработчиков ложится основная задача в любом проекте. Именно они представляют главную ценность команды, и от их работы зависит результат и конечный продукт. От выбора архитектуры до мелочей реализации — каждое ваше решение и подход оказывает первостепенное влияние на качество итогового проекта. Мы будем учиться создавать и запускать полноценные, достойные и по-настоящему качественные продукты. Получится это или нет — зависит от вас.
        </p>
        <p>
            Для того, чтобы мы могли начать налаживать взаимодействие, создавать схемы работы, а также чтобы вы могли показать себя в деле, предлагаем вам выполнить начальное задание. Оно не разделяется на задания для серверных и клиентских программистов. Вне зависимости от специализации, хороший разработчик должен обладать знаниями во всех смежных областях. Поэтому, данное задание включает в себя написание как серверного, так и клиентского кода, а также верстку и дизайн. Что-то у вас получится лучше, а в чем-то, возможно, вы заполните какие-то пробелы. Помимо основной части предлагаем также более сложные задачки для тех, чьи амбиции и знания превосходят основное задание — здесь вы сможете выбрать что-то из своей области. Надеемся, вам будет интересно.
        </p>
        <p>
            А теперь к делу. Все мы сталкиваемся с интересными задачами, которые требуют углубления в тему и поиска решения. Это своего рода личные ислледования в определенной области. Например, вам нужно разработать модуль email-рассылок или создать класс для рисования графиков. Такие вещи требуют решения ряда нетривиальных задач, после закрытия которых ваши профессиональные знания пополнятся этим опытом. Одна из наших идей — закреплять такой опыт в виде написания небольшой статьи о своей теме, ее проблемах и решениях, которые вы нашли. Тогда ваш опыт смогут изучить другие члены команды (и не только), а вы сможете ознакомиться с их решениями. Так мы сможем эффективно делиться знаниями, а заодно будем учиться красиво и понятно излагать свои мысли в текстовой форме. Но нам понадобится движок статей.
        </p>

        <h2>Основная часть</h2>
        <p>Спроектировать и разработать основу будущего модуля статей для этого сайта. В составе модуля должны быть три основных страницы: форма написания статьи, список статей и страница просмотра статьи.</p>

        <h4>Форма написания статьи</h4>
        <p>
            Данный раздел имеет очень большую важность для пользователей — именно отсюда будет начинаться создание особо ценного пользовательского контента. Поэтому ваша задача заключается в том, чтобы создать максимально удобный и приятный в пользовании инструмент.
        </p>
        <p>
            Страница должна включать в себя поле для заполнения заголовка (максимум 80 символов), поле для вступительного абзаца («лида»), выбор файла-изображения для обложки статьи, основное поле для набора текста статьи, а также поле для ввода ключевых слов (тегов).
        </p>
        <p>
            Форма должна позволять как создавать новые публикации, так и редактировать существующие.
        </p>
        <h4>Список статей</h4>
        <p>
            Представляет собой вертикальный список анонсов статей, остортированных по дате. Каждый анонс включает в себя заголовок статьи, изображение обложки, вступительный абзац, автора и дату публикации.
        </p>
        <h4>Страница статьи</h4>

        <p>Включает в себя все известные данные о статье: заголовок, вступление, дату, текст, имя автора и список тегов.</p>

        <h2>Дизайн</h2>
        <p>
            Дизайн всех этих страниц должен быть простым, чистым и легким. Подробная проработка всех элементов не требуется, но минимальное чувство вкуса не помешает.
        </p>
        <h2>Стек технологий</h2>
        <p>На первом этапе работы команды CodeX мы будем использовать классические и проверенные временем инструменты веб-разработки. Рекомендуем вам освежить навыки и использовать в своих реализациях только следующие технологии:
        <p>
            <span class="technic">PHP</span>, <span class="technic">MySQL</span>, <span class="technic">JavaScript</span>, <span class="technic">HTML5</span>, <span class="technic">CSS</span></p>
            <p>Использование сторонних решений, плагинов, расширений и тд не приветствуется — все лучше написать самостоятельно, пусть и минималистично.</p>
        </p>
        <h2>Деплой</h2>
        <p>Полученные файлы необходимо разместить на сервере и обеспечить доступ к работающему модулю по прямой ссылке. Также, весь проект следует разместить в вашем публичном репозитории на <a href="//github.com" target="_blank">GitHub</a></p>
        <h2>А теперь интереснее</h2>
        <p>
            Следующие «усложнения» позволят вам применить навыки в своих сильных сторонах. Каждое задание будет маркироваться специальным знаком, по которому можно будет определить, к какой области задание принадлежит и выбрать для себя что-нибудь подходящее. А лучше сразу несколько из разных областей!
        </p>
        <p>
            <ul class="additional_tasks legend">
                <li class="back">Backend</li>
                <li class="front">Frontend</li>
                <li class="ui">UI/UX</li>
            </ul>
        </p>
        <ul class="additional_tasks">
            <li class="back">Реализовать задание с использованием MVC фреймворка. Например, <a href="//kohanaframework.org" target="_blank">Kohana Framework</a></li>
            <li class="front">Создать минимальный визуальный редактор для формы написания статьи</li>
            <li class="front">В форме написания статьи реализовать загрузку изображения обложки через <span class="technic">AJAX</span></li>
            <li class="back">Реализовать кэширование статьи в <span class="technic">memcache</span> с возможностью очистки кэша при редактировании</li>
            <li class="ui">Выполнить дизайн страниц в стиле этого сайта, изучить похожие разделы на других площадках и использовать лучшие решения</li>
            <li class="front">Реализовать загрузку изображений обложек в списке статей с использованием подхода <span class="technic">Lazy Load</span></li>
            <li class="front">Добавить кнопки «Поделиться» для основных соцсетей. При клике должно показываться всплывающее окно с формой репоста</li>
            <li class="back">Добавить запись счетчика просмотров статей в <span class="technic">Redis</span> и вывод количества просмотров на странице статьи</li>
        </ul>
    </article>
</div>

