<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Статья</title>
<link rel="stylesheet" href="../../../../public/css/article.css">
</head>    
  <body>
    <div class="site_header">
      <div class="center-side">
         <div class="site_menu">
            <a href=" "> Главная </a>
            <a href=" "> Набор в клуб </a>
            <a href=" "> Задания </a>
         </div>
      </div>
    </div>
      <div id="block">
        <h1>Почему курсор мыши наклонён на 45°?</h1>
          <h3> Анастасия Капитонова, сегодня в 20:43 </h3>
             <p align="left"> Посетитель сайта вопросов-ответов StackExchange задал на первый взгляд глупый вопрос: а почему все курсоры во всех операционных системах немножко «кривые», то есть имеют определённый наклон, а не указывают прямо? В самом деле, почему курсор не располагается вертикально, ведь это наиболее удобно для выделения текста и прочих задач?</p>
            
             <p align="center" width="100%"> <img src="../../../../public/img/mouse.jpg" alt="screen" title="Скриншот"></p> 
             
             <p align="left">Ему отвечает эксперт, хорошо знакомый с историей компьютерной техники. Он подтверждает, что изобретатель мыши Дуглас Энгельбарт действительно изображал курсор в виде стрелки вверх, как наиболее логичный вариант выделения (см. скриншот вверху). </p>

             <p align="left">Однако, графический интерфейс операционной системы на практике первой в мире реализовала компания Xerox, а именно — её научно-исследовательское подразделение Palo Alto Research Center. В частности, курсор описан в документе от 1981 года, который перечисляет характеристики XEROX PARC, первого в истории компьютера с графическим пользовательским интерфейсом.</p>

             <p align="left">При проектировании этой машины обнаружилось, что из-за низкого разрешения дисплеев того времени невозможно создать из пикселов нормальный вертикальный курсор маленького размера. Решено было не увеличивать размер указателя, а вместо этого слегка повернуть его, чтобы одна грань была вертикальной, а вторая наклонялась на 45°.</p>
            
             <p align="center" width="100%"> <img src="../../../../public/img/cursor.png" alt="cursor" title="Курсор"> </p> 
            
             <p align="left"> Минуло более 30 лет, появились дисплеи высокого разрешения, но традиция изображать курсор наклонённым на 45° сохранилась. </p>
                        
              <div class="icons">
                       <i class="demo-icon">&#xe804</i>
                       <i class="demo-icon">&#xe805</i>
                       <i class="demo-icon">&#xe800</i>

              </div>
              <hr>
              <div class="comment">
                   <i class="demo-icon">&#xe806;</i> <span>Оставить комментарий</span> 
              </div>
       </div>  
 </body>
</html>
