<!doctype html>
<html>
<head>
<meta charset="utf-8">
<title>Статья</title>
<link rel="stylesheet" href="../../../../public/css/list.css">
</head>    
  <body>
    <div class="site_header">
      <div class="center-side">
         <div class="site_menu">
            <a href=" "> Главная </a>
            <a href=" "> Набор в клуб </a>
            <a href=" "> Задания </a>
         </div>
      </div>
    </div>
           <div id=block>
           <h1>Все статьи</h1>
           <h3><i>Android 6.0: Doze Mode, App Standby, Runtime Permissions. Всё, что необходимо знать каждому разработчику</i></h3>
           <h4>Джон Сноу, 25.10.2018</h4>
           <img  src="../../../../public/img/android_cat.jpg"><p>В этой статье мы рассмотрим три самых важных изменения в новом Android, которые не могут быть проигнорированы ни одним разработчиком, который поставил у себя в проекте targetSdk = 23 и выше. 
Doze Mode — режим «отключки», в который переходят все устройства на Marshmallow после некоторого времени обездвижения без зарядки. 

App Standby — автоматическое лишение приложений доступа к ресурсам устройства, всех которые давно не открывал пользователь. 

Runtime Permissions — новая модель запроса разрешений. Теперь мы, как разработчики, каждый раз обращаясь, например, к микрофону устройства, должны проверять, есть ли у нашего приложения разрешение на доступ к нему. </p> 
            <button>Далее →</button>

           <h3><i>Помогите #tceh улучшить UX и получите скидку на курс</i></h3>
           <h4>Джон Сноу, 25.10.2017</h4>
           <img src="../../../../public/img/ux-hbrhbr.png"><p>Привет! Мы хотим улучшить UX у наших продуктов. Это нетривиальная задача — продуктов много, а нас мало. А вы, аудитория Хабра, обладаете чутьём на прекрасное и правильное.

Предлагаем сделку: 

Вы заходите на посадочную #tceh_коворкинга, #tceh_трекшена, в наш блог и на страницу с расписанием мероприятий, делаете скриншот и пишите, что конкретно можно улучшить, чтобы вам было удобнее и понятнее.</p>
          <button>Далее →</button>
          <h3><i>Уроки написания утилитки на $1 000 000</i></h3>
          <h4>Джон Сноу, 25.10.2016</h4>
          <img src="../../../../public/img/utilita.jpg"><p>Осенью 2008 года мы с приятелем потратили две-три недели свободного от основной работы времени, чтобы написать маленькую утилитку для бэкапа баз данных (MS SQL Server и потом MySQL). Сегодня она приносит нам около $230 000 в год и можно с уверенностью говорить, что суммарно мы заработаем на ней больше $1 000 000.

Под катом я расскажу, как это получилось и какие уроки мы из этого извлекли. Вполне возможно, что нам просто глупо повезло и опыт этот целиком неверен и теории не соответствует и только навредит вашему начинанию — читайте на свой страх и риск.</p>
          <button>Далее →</button>
         

 
      </div>
  </body>
</html>